test/artillery/joinroom.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 30
      arrivalRate: 20
scenarios:
  - engine: "socketio"
    flow:
      - think: 1
      - emit:
          channel: "joinRoom"
          data: "{{ naughtyString }}"
          namespace: "/"
  - engine: "socketio"
    flow:
      - think: 1
      - emit:
          channel: "joinRoom"
          data: "create"
          namespace: "/"